## [Portal GitOps Resources](https://ziggy.app.us.spacelift.io/stack/portal-gitops-resources/run/01KMPC7AZ45F7JADMMXH4YJWZH) plan logs

<details>
<summary>Click here to expand</summary>

```
[01KMMXMDFQS8T0HTE4QM3YB219] Planning changes with 13 custom hooks...
🚀 Running TFLint...
[01KMPC7AZ45F7JADMMXH4YJWZH] (TFLint) Initializing TFLint...
[01KMPC7AZ45F7JADMMXH4YJWZH] (TFLint) Running TFLint scan...
[01KMPC7AZ45F7JADMMXH4YJWZH] (TFLint) ✓ No TFLint issues found
[SpaceForge] Running hook: after_plan
[SpaceForge] Hook completed: after_plan
🚀 Running Infracost...
2026-03-27T00:57:42Z INFO Autodetected 1 Terraform project across 1 root module
2026-03-27T00:57:42Z INFO Found Terraform project "main" at directory "." using Terraform var files "terraform.tfvars"
2026-03-27T00:57:43Z INFO Output saved to infracost.custom.spacelift.json
--- Infracost ASCII Report ---
Project: main

 Name  Monthly Qty  Unit  Monthly Cost   
                                         
 OVERALL TOTAL                  $0.00 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
9 cloud resources were detected:
∙ 0 were estimated
∙ 9 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃         $0.00 ┃           - ┃      $0.00 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
🚀 Running TruffleHog...
[SpaceForge] Running hook: after_plan
[SpaceForge] Hook completed: after_plan
🚀 Running Trivy...
[01KMPC7AZ45F7JADMMXH4YJWZH] (Trivy) ✓ No security issues found
[SpaceForge] Running hook: after_plan
[SpaceForge] Hook completed: after_plan
🚀 Running Checkov...
[01KMPC7AZ45F7JADMMXH4YJWZH] (Checkov) Running Checkov with arguments: --directory . --output json --quiet --soft-fail --download-external-modules true --skip-path state-credentials.tf --skip-path .external_modules --framework terraform,kubernetes,helm,secrets
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
[01KMPC7AZ45F7JADMMXH4YJWZH] (Checkov) ✓ No security issues found
[SpaceForge] Running hook: after_plan
[SpaceForge] Hook completed: after_plan
data.google_project.project: Reading...
google_service_account.cloudplatform_gsa: Refreshing state... [id=projects/cne-development/serviceAccounts/liferay-portal-poc-cp-iam@cne-development.iam.gserviceaccount.com]
data.google_client_config.default: Reading...
data.google_client_config.default: Read complete after 1s [id=projects/cne-development/regions/us-central1/zones/]
2026-03-27T00:58:17.754Z [WARN]  Provider "provider[\"registry.opentofu.org/hashicorp/google\"]" produced an invalid plan for google_service_account.cloudplatform_gsa, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .disabled: planned value cty.False for a non-computed attribute
      - .display_name: planned value cty.StringVal("") for a non-computed attribute
google_service_account_iam_member.cloudplatform_wi_binding: Refreshing state... [id=projects/cne-development/serviceAccounts/liferay-portal-poc-cp-iam@cne-development.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:cne-development.svc.id.goog[crossplane-system/provider-gcp-cloudplatform]]
google_project_iam_member.cloudplatform_roles["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=cne-development/roles/resourcemanager.projectIamAdmin/serviceAccount:liferay-portal-poc-cp-iam@cne-development.iam.gserviceaccount.com]
google_project_iam_member.cloudplatform_roles["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=cne-development/roles/iam.serviceAccountAdmin/serviceAccount:liferay-portal-poc-cp-iam@cne-development.iam.gserviceaccount.com]
data.google_project.project: Read complete after 1s [id=projects/cne-development]
google_project_iam_member.provider_direct_iam["storage"]: Refreshing state... [id=cne-development/roles/storage.admin/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/crossplane-system/sa/provider-gcp-storage]
google_project_iam_member.provider_direct_iam["kms"]: Refreshing state... [id=cne-development/roles/cloudkms.admin/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/crossplane-system/sa/provider-gcp-kms]
google_project_iam_member.provider_direct_iam["sql"]: Refreshing state... [id=cne-development/roles/cloudsql.admin/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/crossplane-system/sa/provider-gcp-sql]
2026-03-27T00:58:17.980Z [WARN]  Provider "registry.opentofu.org/hashicorp/google" produced an unexpected new value for google_project_iam_member.cloudplatform_roles["roles/iam.serviceAccountAdmin"] during refresh.
      - .etag: was cty.StringVal("BwZN3jVAsiA="), but now cty.StringVal("BwZN9JI2/AI=")
google_project_iam_member.provider_direct_iam["compute"]: Refreshing state... [id=cne-development/roles/compute.admin/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/crossplane-system/sa/provider-gcp-compute]
google_project_iam_member.secrets_accessor_permissions[0]: Refreshing state... [id=cne-development/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/external-secrets/sa/external-secrets/liferay_external_secrets_access//resource.name.startsWith('projects/1010819446150/secrets/liferay-certificates-') || resource.name.startsWith('projects/1010819446150/secrets/liferay-licenses-') || resource.name.startsWith('projects/1010819446150/secrets/liferay-credentials-gitops')]
kubernetes_cluster_role.eso_secret_writer: Refreshing state... [id=eso-cluster-secret-writer]
2026-03-27T00:58:18.150Z [WARN]  Provider "registry.opentofu.org/hashicorp/google" produced an unexpected new value for google_project_iam_member.provider_direct_iam["storage"] during refresh.
      - .etag: was cty.StringVal("BwZN3jVAsiA="), but now cty.StringVal("BwZN9JI2/AI=")
2026-03-27T00:58:18.352Z [WARN]  Provider "registry.opentofu.org/hashicorp/google" produced an unexpected new value for google_project_iam_member.cloudplatform_roles["roles/resourcemanager.projectIamAdmin"] during refresh.
      - .etag: was cty.StringVal("BwZN3jVAsiA="), but now cty.StringVal("BwZN9JI2/AI=")
2026-03-27T00:58:18.438Z [WARN]  Provider "registry.opentofu.org/hashicorp/google" produced an unexpected new value for google_project_iam_member.provider_direct_iam["kms"] during refresh.
      - .etag: was cty.StringVal("BwZN7KaN0JQ="), but now cty.StringVal("BwZN9JI2/AI=")
2026-03-27T00:58:18.565Z [WARN]  Provider "registry.opentofu.org/hashicorp/google" produced an unexpected new value for google_project_iam_member.provider_direct_iam["sql"] during refresh.
      - .etag: was cty.StringVal("BwZN3jVAsiA="), but now cty.StringVal("BwZN9JI2/AI=")
2026-03-27T00:58:18.739Z [WARN]  Provider "registry.opentofu.org/hashicorp/google" produced an unexpected new value for google_project_iam_member.provider_direct_iam["compute"] during refresh.
      - .etag: was cty.StringVal("BwZN3jVAsiA="), but now cty.StringVal("BwZN9JI2/AI=")
2026-03-27T00:58:18.758Z [WARN]  Provider "provider[\"registry.opentofu.org/hashicorp/kubernetes\"]" produced an invalid plan for kubernetes_cluster_role.eso_secret_writer, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .metadata[0].annotations: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .metadata[0].generate_name: planned value cty.StringVal("") for a non-computed attribute
      - .rule[0].non_resource_urls: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .rule[0].resource_names: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
2026-03-27T00:58:18.843Z [WARN]  Provider "registry.opentofu.org/hashicorp/google" produced an unexpected new value for google_project_iam_member.secrets_accessor_permissions[0] during refresh.
      - .etag: was cty.StringVal("BwZN3jVAsiA="), but now cty.StringVal("BwZN9JI2/AI=")
2026-03-27T00:58:18.855Z [WARN]  Provider "provider[\"registry.opentofu.org/hashicorp/google\"]" produced an invalid plan for google_project_iam_member.secrets_accessor_permissions[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .condition[0].description: planned value cty.StringVal("") for a non-computed attribute
2026-03-27T00:58:20.100Z [WARN]  unexpected data: registry.opentofu.org/hashicorp/kubernetes:stderr="I0327 00:58:20.092788     212 request.go:697] Waited for 1.065425867s due to client-side throttling, not priority and fairness, request: GET:https://connectgateway.googleapis.com/v1/projects/1010819446150/locations/global/gkeMemberships/liferay-portal-poc-membership/openapi/v2?timeout=30s"
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
kubernetes_manifest.infrastructure_appproject: Refreshing state...
kubernetes_manifest.function_environment_configs: Refreshing state...
kubernetes_manifest.function_auto_ready: Refreshing state...
kubernetes_manifest.argocd_gateway_class: Refreshing state...
kubernetes_manifest.function_go_templating: Refreshing state...
kubernetes_manifest.secret_store: Refreshing state...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
kubernetes_manifest.function_auto_ready_runtime_config: Refreshing state...
kubernetes_manifest.function_go_templating_runtime_config: Refreshing state...
kubernetes_manifest.function_environment_configs_runtime_config: Refreshing state...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
kubernetes_manifest.argocd_gateway_proxy_config: Refreshing state...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
[01KMMXMDFQS8T0HTE4QM3YB219] Still running...
kubernetes_cluster_role_binding.eso_secret_writer_binding: Refreshing state... [id=eso-cluster-secret-writer-binding]
2026-03-27T01:02:16.180Z [WARN]  Provider "provider[\"registry.opentofu.org/hashicorp/kubernetes\"]" produced an invalid plan for kubernetes_cluster_role_binding.eso_secret_writer_binding, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .metadata[0].annotations: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .metadata[0].generate_name: planned value cty.StringVal("") for a non-computed attribute
kubernetes_manifest.liferay_appproject: Refreshing state...
kubernetes_manifest.git_repo_credentials_external_secret["liferay"]: Refreshing state...
kubernetes_manifest.infrastructure_provider_application: Refreshing state...
2026-03-27T01:02:44.044Z [WARN]  Provider "registry.opentofu.org/hashicorp/kubernetes" produced an unexpected new value for kubernetes_manifest.infrastructure_provider_application during refresh.
      - .object.spec.sources[0].targetRevision: was cty.StringVal("0.0.1"), but now cty.StringVal("master")
kubernetes_manifest.infrastructure_applicationset: Refreshing state...
kubernetes_manifest.liferay_applicationset: Refreshing state...
2026-03-27T01:02:55.707Z [WARN]  Provider "registry.opentofu.org/hashicorp/kubernetes" produced an unexpected new value for kubernetes_manifest.infrastructure_applicationset during refresh.
      - .object.spec.template.spec.sources[0].targetRevision: was cty.StringVal("0.0.1"), but now cty.StringVal("master")
2026-03-27T01:02:56.200Z [WARN]  Provider "registry.opentofu.org/hashicorp/kubernetes" produced an unexpected new value for kubernetes_manifest.liferay_applicationset during refresh.
      - .object.spec.template.spec.sources[0].targetRevision: was cty.StringVal("0.4.2"), but now cty.StringVal("master")

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # kubernetes_manifest.infrastructure_applicationset will be updated in-place
  ~ resource "kubernetes_manifest" "infrastructure_applicationset" {
      ~ object   = {
          ~ spec       = {
              ~ template                     = {
                  ~ spec     = {
                      ~ sources              = [
                          ~ {
                                name           = null
                              ~ targetRevision = "master" -> "0.0.1"
                                # (8 unchanged attributes hidden)
                            },
                            {
                                chart          = null
                                directory      = {
                                    exclude = null
                                    include = null
                                    jsonnet = {
                                        extVars = null
                                        libs    = null
                                        tlas    = null
                                    }
                                    recurse = null
                                }
                                helm           = {
                                    apiVersions             = null
                                    fileParameters          = null
                                    ignoreMissingValueFiles = null
                                    kubeVersion             = null
                                    namespace               = null
                                    parameters              = null
                                    passCredentials         = null
                                    releaseName             = null
                                    skipCrds                = null
                                    skipSchemaValidation    = null
                                    skipTests               = null
                                    valueFiles              = null
                                    values                  = null
                                    valuesObject            = null
                                    version                 = null
                                }
                                kustomize      = {
                                    apiVersions               = null
                                    commonAnnotations         = null
                                    commonAnnotationsEnvsubst = null
                                    commonLabels              = null
                                    components                = null
                                    forceCommonAnnotations    = null
                                    forceCommonLabels         = null
                                    ignoreMissingComponents   = null
                                    images                    = null
                                    kubeVersion               = null
                                    labelIncludeTemplates     = null
                                    labelWithoutSelector      = null
                                    namePrefix                = null
                                    nameSuffix                = null
                                    namespace                 = null
                                    patches                   = null
                                    replicas                  = null
                                    version                   = null
                                }
                                name           = null
                                path           = null
                                plugin         = {
                                    env        = null
                                    name       = null
                                    parameters = null
                                }
                                ref            = "values"
                                repoURL        = "https://github.com/Ziggy-AZ/cloud-native-gitops-boilerplate-gcp-2026-02-27.git"
                                targetRevision = "HEAD"
                            },
                        ]
                        # (8 unchanged attributes hidden)
                    }
                    # (1 unchanged attribute hidden)
                }
                # (9 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.infrastructure_provider_application will be updated in-place
  ~ resource "kubernetes_manifest" "infrastructure_provider_application" {
      ~ manifest = {
          ~ spec       = {
              ~ sources     = [
                    {
                        helm           = {
                            parameters = [
                                {
                                    name  = "crossplaneNamespace"
                                    value = "crossplane-system"
                                },
                                {
                                    name  = "deploymentName"
                                    value = "liferay-portal-poc"
                                },
                                {
                                    name  = "gateway.className"
                                    value = "liferay-gateway-class"
                                },
                                {
                                    name  = "gateway.namespace"
                                    value = "envoy-gateway-system"
                                },
                                {
                                    name  = "gcp.projectId"
                                    value = "cne-development"
                                },
                                {
                                    name  = "gcp.projectNumber"
                                    value = "1010819446150"
                                },
                            ]
                            valueFiles = [
                                "$values/liferay/system/infrastructure-provider.yaml",
                            ]
                        }
                        path           = "gcp-infrastructure-provider"
                        repoURL        = "https://github.com/Ziggy-AZ/liferay-gcp-charts.git"
                        targetRevision = "0.0.1"
                    },
                  + {
                      + chart          = "liferay-gcp-infrastructure-provider"
                      + kustomize      = {}
                      + repoURL        = "https://github.com/Ziggy-AZ/liferay-gcp-charts.git"
                      + targetRevision = "0.0.1"
                    },
                    {
                        ref            = "values"
                        repoURL        = "https://github.com/Ziggy-AZ/cloud-native-gitops-boilerplate-gcp-2026-02-27.git"
                        targetRevision = "HEAD"
                    },
                ]
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ sources              = [
                  ~ {
                        name           = null
                      ~ targetRevision = "master" -> "0.0.1"
                        # (8 unchanged attributes hidden)
                    },
                  ~ {
                      ~ chart          = null -> "liferay-gcp-infrastructure-provider"
                        name           = null
                      ~ ref            = "values" -> (known after apply)
                      ~ repoURL        = "https://github.com/Ziggy-AZ/cloud-native-gitops-boilerplate-gcp-2026-02-27.git" -> "https://github.com/Ziggy-AZ/liferay-gcp-charts.git"
                      ~ targetRevision = "HEAD" -> "0.0.1"
                        # (5 unchanged attributes hidden)
                    },
                  + {
                      + chart          = (known after apply)
                      + directory      = {
                          + exclude = (known after apply)
                          + include = (known after apply)
                          + jsonnet = {
                              + extVars = (known after apply)
                              + libs    = (known after apply)
                              + tlas    = (known after apply)
                            }
                          + recurse = (known after apply)
                        }
                      + helm           = {
                          + apiVersions             = (known after apply)
                          + fileParameters          = (known after apply)
                          + ignoreMissingValueFiles = (known after apply)
                          + kubeVersion             = (known after apply)
                          + namespace               = (known after apply)
                          + parameters              = (known after apply)
                          + passCredentials         = (known after apply)
                          + releaseName             = (known after apply)
                          + skipCrds                = (known after apply)
                          + skipSchemaValidation    = (known after apply)
                          + skipTests               = (known after apply)
                          + valueFiles              = (known after apply)
                          + values                  = (known after apply)
                          + valuesObject            = (known after apply)
                          + version                 = (known after apply)
                        }
                      + kustomize      = {
                          + apiVersions               = (known after apply)
                          + commonAnnotations         = (known after apply)
                          + commonAnnotationsEnvsubst = (known after apply)
                          + commonLabels              = (known after apply)
                          + components                = (known after apply)
                          + forceCommonAnnotations    = (known after apply)
                          + forceCommonLabels         = (known after apply)
                          + ignoreMissingComponents   = (known after apply)
                          + images                    = (known after apply)
                          + kubeVersion               = (known after apply)
                          + labelIncludeTemplates     = (known after apply)
                          + labelWithoutSelector      = (known after apply)
                          + namePrefix                = (known after apply)
                          + nameSuffix                = (known after apply)
                          + namespace                 = (known after apply)
                          + patches                   = (known after apply)
                          + replicas                  = (known after apply)
                          + version                   = (known after apply)
                        }
                      + name           = (known after apply)
                      + path           = (known after apply)
                      + plugin         = {
                          + env        = (known after apply)
                          + name       = (known after apply)
                          + parameters = (known after apply)
                        }
                      + ref            = "values"
                      + repoURL        = "https://github.com/Ziggy-AZ/cloud-native-gitops-boilerplate-gcp-2026-02-27.git"
                      + targetRevision = "HEAD"
                    },
                ]
                # (8 unchanged attributes hidden)
            }
            # (4 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.liferay_applicationset will be updated in-place
  ~ resource "kubernetes_manifest" "liferay_applicationset" {
      ~ object   = {
          ~ spec       = {
              ~ template                     = {
                  ~ spec     = {
                      ~ sources              = [
                          ~ {
                                name           = null
                              ~ targetRevision = "master" -> "0.4.2"
                                # (8 unchanged attributes hidden)
                            },
                            {
                                chart          = null
                                directory      = {
                                    exclude = null
                                    include = null
                                    jsonnet = {
                                        extVars = null
                                        libs    = null
                                        tlas    = null
                                    }
                                    recurse = null
                                }
                                helm           = {
                                    apiVersions             = null
                                    fileParameters          = null
                                    ignoreMissingValueFiles = null
                                    kubeVersion             = null
                                    namespace               = null
                                    parameters              = null
                                    passCredentials         = null
                                    releaseName             = null
                                    skipCrds                = null
                                    skipSchemaValidation    = null
                                    skipTests               = null
                                    valueFiles              = null
                                    values                  = null
                                    valuesObject            = null
                                    version                 = null
                                }
                                kustomize      = {
                                    apiVersions               = null
                                    commonAnnotations         = null
                                    commonAnnotationsEnvsubst = null
                                    commonLabels              = null
                                    components                = null
                                    forceCommonAnnotations    = null
                                    forceCommonLabels         = null
                                    ignoreMissingComponents   = null
                                    images                    = null
                                    kubeVersion               = null
                                    labelIncludeTemplates     = null
                                    labelWithoutSelector      = null
                                    namePrefix                = null
                                    nameSuffix                = null
                                    namespace                 = null
                                    patches                   = null
                                    replicas                  = null
                                    version                   = null
                                }
                                name           = null
                                path           = null
                                plugin         = {
                                    env        = null
                                    name       = null
                                    parameters = null
                                }
                                ref            = "values"
                                repoURL        = "https://github.com/Ziggy-AZ/cloud-native-gitops-boilerplate-gcp-2026-02-27.git"
                                targetRevision = "HEAD"
                            },
                        ]
                        # (8 unchanged attributes hidden)
                    }
                    # (1 unchanged attribute hidden)
                }
                # (9 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

[01KMMXMDFQS8T0HTE4QM3YB219] Changes are GO
[01KMMXMDFQS8T0HTE4QM3YB219] Generating JSON representation of the plan...
[01KMMXMDFQS8T0HTE4QM3YB219] JSON representation is GO
[01KMMXMDFQS8T0HTE4QM3YB219] Generating Infracost JSON report from plan

[01KMMXMDFQS8T0HTE4QM3YB219] Infracost report generated successfully
[01KMMXMDFQS8T0HTE4QM3YB219] Uploading the list of managed resources...
[01KMMXMDFQS8T0HTE4QM3YB219] Infracost report found from previous steps
[01KMMXMDFQS8T0HTE4QM3YB219] Mapping Infracost data to resources
[01KMMXMDFQS8T0HTE4QM3YB219] Costs mapped successfully
[01KMMXMDFQS8T0HTE4QM3YB219] Please be aware that the run changes calculation includes output changes.
[01KMMXMDFQS8T0HTE4QM3YB219] Resource list upload is GO
[01KMMXMDFQS8T0HTE4QM3YB219] Loading custom plan policy inputs...
[01KMMXMDFQS8T0HTE4QM3YB219] 4 custom plan policy inputs found: checkov, infracost, tflint, trivy
[01KMMXMDFQS8T0HTE4QM3YB219] Evaluated 6 plan policies
[01KMMXMDFQS8T0HTE4QM3YB219] Plan policy warning: 

🛠️ SECURITY & COST SUMMARY

💰 Cost Estimate: Total Monthly: $0 (Change: $0)

🛡️ Checkov: PASS (0 Failed Checks)

🛡️ Trivy: PASS (0 Findings)

🔍 TFLint: PASS (0 Issues)

🐽 TruffleHog: No data available.


[01KMMXMDFQS8T0HTE4QM3YB219] Plan checks are GO
```

</details>